# RoomBaseAboveComputationHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomBaseAboveComputationHeight Property
BuiltInFailures..::..RoomFailures Class See Also
---
[RoomBase]'s lower offset is above the Computation Height
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomBaseAboveComputationHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomBaseAboveComputationHeight As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomBaseAboveComputationHeight {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace